{
  "backend/main.mo": "Main Motoko actor for the NurPay wallet backend, defining types and state for users, transactions, notifications, support tickets, and app settings, with access control and blob storage mixins included.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (PWA support, icon assets, install banner) to their associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose of each page, component, hook, and utility in the React app.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app with PWA meta tags, manifest link, Apple touch icon, and inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for BDT NURPAY WALLET specifying app name, theme colors, standalone display, portrait orientation, and 192x192/512x512 icon entries.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets and network-first for navigation and API calls, with versioned caches and bypass rules for admin routes and ICP backend endpoints.",
  "frontend/src/App.tsx": "Defines the full client-side router using TanStack Router with all app routes (auth, transactions, admin, profile) and wraps the app in a QueryClientProvider and Toaster.",
  "frontend/src/components/AnnouncementMarquee.tsx": "Renders a horizontally scrolling marquee banner displaying a list of announcement strings with a 'Notice' label and megaphone icon.",
  "frontend/src/components/AppHeader.tsx": "Sticky top header showing the NuroPay logo and user greeting, or a back button with title; includes a notification bell with unread count badge.",
  "frontend/src/components/BalanceCard.tsx": "Displays the user's account balance, name, and mobile number in a styled gradient card with a toggle to show or hide the balance.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Home, History, Notifications, and Profile tabs; highlights the active route and shows an unread notification badge.",
  "frontend/src/components/ConfirmationModal.tsx": "A dialog modal that displays transaction details and total amount for user review, with Cancel and Confirm buttons and a loading state.",
  "frontend/src/components/InstallBanner.tsx": "Shows a dismissible PWA install prompt banner using the usePWAInstall hook; hidden if already installed or dismissed.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper that renders children inside an app container and optionally includes the BottomNav component.",
  "frontend/src/components/NotificationItem.tsx": "Renders a single notification as a clickable card with read/unread styling, title, body, timestamp, and a mark-as-read callback.",
  "frontend/src/components/PhotoUpload.tsx": "File input component for uploading a photo (e.g., KYC), showing a preview with a remove button or a dashed placeholder with camera icon.",
  "frontend/src/components/ProcessingScreen.tsx": "Full-screen loading indicator with a spinning loader, 'Processing' heading, a custom message, and animated pulsing dots.",
  "frontend/src/components/ServiceGrid.tsx": "Renders a 3-column grid of service shortcut buttons (Send Money, Recharge, etc.) each navigating to the corresponding route.",
  "frontend/src/components/TransactionListItem.tsx": "Renders a single transaction as a clickable list item with type-specific icons, colored backgrounds, amount (incoming/outgoing), recipient/provider, and a status badge with icon.",
  "frontend/src/components/TransactionSlip.tsx": "Displays a printable transaction receipt card showing type, amount, status, and details (ID, date, recipient/provider) with Save Slip and Done action buttons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states.",
  "frontend/src/hooks/usePWAInstall.ts": "Hook that tracks PWA installability by capturing the beforeinstallprompt event, exposes installApp and dismissPrompt helpers, and persists dismissed state in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend interactions including user profile fetching, registration, login, transaction CRUD, and notification queries/mutations via the actor.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/utilities, OKLCH CSS custom properties for the NuroPay green theme (light/dark), and utility classes for shadows, gradients, status badges, animations, and layout.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard with tabbed navigation covering stats, transaction control, user management, transaction management, notifications, and support tickets, protected by admin auth check.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page that validates hardcoded credentials, generates a token, and redirects to the admin dashboard on success.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a sorted list of user transactions with loading skeletons and a detail view via TransactionSlip on item click.",
  "frontend/src/pages/HomePage.tsx": "Main dashboard showing the user's balance, a grid of service shortcuts (send, recharge, etc.), and header actions for notifications, profile, and logout.",
  "frontend/src/pages/KYCPage.tsx": "KYC submission form with NID, name, address, and photo upload fields, plus status banners for approved/pending/rejected states.",
  "frontend/src/pages/LoginPage.tsx": "Login and registration page with tabbed forms for mobile/PIN authentication and new account creation.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications sorted by date with skeleton loading and marks individual notifications as read on interaction.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page with sections for PIN change, biometric toggle, support ticket creation/history, and an FAQ accordion.",
  "frontend/src/pages/transactions/AddMoneyPage.tsx": "Thin wrapper around TransactionPage configured for the addMoney transaction type with source provider and account number fields.",
  "frontend/src/pages/transactions/BankTransferPage.tsx": "Thin wrapper around TransactionPage configured for bankTransfer with bank name, account number, and routing number fields.",
  "frontend/src/pages/transactions/CashOutPage.tsx": "Thin wrapper around TransactionPage configured for cashOut with mobile wallet provider and account number fields.",
  "frontend/src/pages/transactions/PayBillPage.tsx": "Thin wrapper around TransactionPage configured for payBill with biller name and bill account number fields.",
  "frontend/src/pages/transactions/RechargePage.tsx": "Thin wrapper around TransactionPage configured for mobile recharge with phone number and operator selection fields.",
  "frontend/src/pages/transactions/SavingsPage.tsx": "Thin wrapper around TransactionPage configured for savings with plan duration and purpose/note fields.",
  "frontend/src/pages/transactions/SendMoneyPage.tsx": "Thin wrapper around TransactionPage configured for sendMoney with a single recipient mobile number field.",
  "frontend/src/pages/transactions/TransactionPage.tsx": "Generic multi-step transaction page (form → confirm → processing → slip) that validates KYC/balance, submits transactions via API, and updates local balance state.",
  "frontend/src/store/authStore.ts": "Zustand store managing authenticated user state (id, name, mobile, balance, KYC status) with localStorage session persistence and login/logout actions.",
  "frontend/src/utils/adminAuth.ts": "Utility functions for admin authentication using hardcoded credentials stored as a plain-text token in localStorage.",
  "frontend/src/utils/deviceFingerprint.ts": "Generates and persists a browser-based device fingerprint using a hash of navigator/screen properties stored in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/src/utils/validation.ts": "Validation helpers for Bangladeshi mobile numbers, PINs, and NID numbers, plus formatting utilities for BDT currency and nanosecond timestamps.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color tokens, extended typography/shadow/animation utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot (version 11) describing the BDT NURPAY WALLET app's current features, architectural decisions, known bugs, color theme, admin credentials, and image requirements."
}