{
  "backend/main.mo": "Main Motoko actor for a mobile banking app defining types (User, Transaction, Notification, SupportTicket), state maps, and helper functions including admin token validation and a simple hash function. Includes access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: admin panel login with credentials nuralom1/9040 and the full user registration/login authentication flow, each with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, covering pages, hooks, utilities, and store modules in the React frontend.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Mobile Banking App' that mounts the React app at the #root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes (login, home, 7 transaction pages, profile, KYC, notifications, history, admin login/dashboard) and wraps the app in QueryClientProvider and Toaster.",
  "frontend/src/components/AnnouncementMarquee.tsx": "Displays a scrolling marquee banner of announcement strings with a 'Notice' label and megaphone icon.",
  "frontend/src/components/AppHeader.tsx": "Sticky app header showing the NuroPay logo and user greeting, or a back button with page title, plus a notification bell with unread count badge.",
  "frontend/src/components/BalanceCard.tsx": "Card component displaying the user's balance in BDT with a show/hide toggle, along with account holder name and mobile number.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Home, History, Alerts, Profile) that highlights the active route and shows an unread notification badge count.",
  "frontend/src/components/ConfirmationModal.tsx": "Modal dialog that displays transaction details and a total amount for user review, with Cancel and Confirm action buttons and a loading state.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that renders page content inside a container and optionally shows the BottomNav.",
  "frontend/src/components/NotificationItem.tsx": "Renders a single notification as a clickable button, visually distinguishing read vs. unread state with icons, title, body, and timestamp.",
  "frontend/src/components/PhotoUpload.tsx": "Photo upload component that reads a selected image file as a data URL, shows a preview with a clear option, and exposes the URL via a callback.",
  "frontend/src/components/ProcessingScreen.tsx": "Full-screen loading indicator with a spinning loader, a processing message, and animated pulsing dots shown during transaction processing.",
  "frontend/src/components/ServiceGrid.tsx": "3-column grid of service shortcut buttons (Send Money, Recharge, etc.) that each navigate to their respective route on click.",
  "frontend/src/components/TransactionListItem.tsx": "Compact list row for a single transaction showing type icon, label, recipient/provider, amount (colored by direction), and status badge.",
  "frontend/src/components/TransactionSlip.tsx": "Printable transaction receipt card displaying a gradient header, amount, status, and detail rows, with Save Slip (print) and Done buttons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including user profile, registration/login, transactions, and notifications using the canister actor.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind CSS imports, CSS custom properties for the NuroPay green theme (light/dark), and utility classes for layout, animations, and status indicators.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabbed navigation covering stats, transaction control, user management, transaction management, notifications, and support tickets, guarded by admin authentication.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page that validates credentials, generates and stores an admin token, and redirects to the dashboard on success.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a sorted list of user transactions with loading skeletons and an empty state, and shows a detailed TransactionSlip when a transaction is selected.",
  "frontend/src/pages/HomePage.tsx": "Main dashboard page showing the user's balance, a grid of financial service shortcuts, and a header with notifications, profile, and logout actions.",
  "frontend/src/pages/KYCPage.tsx": "KYC verification form page that allows users to submit identity details and a photo, displaying status banners for approved, pending, or rejected KYC states.",
  "frontend/src/pages/LoginPage.tsx": "Renders the NuroPay login/register page with tab switching between a login form (mobile + PIN) and a registration form, handling auth state redirects and localized error messages.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays a sorted list of user notifications with loading skeletons and an empty state, and allows marking individual notifications as read.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page providing PIN change, biometric toggle, support ticket creation/viewing, and an FAQ accordion, with auth guard redirecting unauthenticated users.",
  "frontend/src/pages/transactions/AddMoneyPage.tsx": "Thin wrapper around TransactionPage configured for the addMoney transaction type with provider selection and account/reference number fields.",
  "frontend/src/pages/transactions/BankTransferPage.tsx": "Thin wrapper around TransactionPage configured for the bankTransfer transaction type with bank name, account number, and routing number fields.",
  "frontend/src/pages/transactions/CashOutPage.tsx": "Thin wrapper around TransactionPage configured for the cashOut transaction type with mobile wallet provider selection and account number input.",
  "frontend/src/pages/transactions/PayBillPage.tsx": "Thin wrapper around TransactionPage configured for the payBill transaction type with biller selection and bill account number input.",
  "frontend/src/pages/transactions/RechargePage.tsx": "Thin wrapper around TransactionPage configured for the recharge transaction type with mobile number input and telecom operator selection.",
  "frontend/src/pages/transactions/SavingsPage.tsx": "Renders a savings transaction page using TransactionPage with fields for selecting a savings plan duration and entering a purpose/note.",
  "frontend/src/pages/transactions/SendMoneyPage.tsx": "Renders a send money transaction page using TransactionPage with a single recipient mobile number field.",
  "frontend/src/pages/transactions/TransactionPage.tsx": "Generic multi-step transaction page component handling form input, confirmation modal, processing screen, and transaction slip display with balance validation and KYC checks.",
  "frontend/src/store/authStore.ts": "Zustand store managing authentication state (userId, balance, KYC status) with localStorage session persistence and actions for login, logout, and balance/KYC updates.",
  "frontend/src/utils/adminAuth.ts": "Provides hardcoded admin credential validation and localStorage-based token management for admin authentication.",
  "frontend/src/utils/deviceFingerprint.ts": "Generates and persists a browser-based device fingerprint using navigator/screen properties hashed into a unique string stored in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers.",
  "frontend/src/utils/validation.ts": "Provides validation functions for Bangladeshi mobile numbers, PINs, and NID numbers, plus BDT currency and timestamp formatting utilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom green-themed color palette using OKLCH, extended typography, border radius, box shadows, and animation keyframes for the mobile banking app.",
  "project_state.json": "Project state document describing the full feature set, architecture, design guidelines, and known issues for a Bangladeshi mobile banking app built on ICP with admin panel and KYC/transaction systems."
}