{
  "kind": "build_request",
  "title": "Android PWA Install Support (Android 10–16) & App Completeness Polish",
  "projectName": "BDT NURPAY WALLET",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Add Progressive Web App (PWA) support so the app can be installed on Android devices running Android 10 through Android 16. Create a valid web app manifest (manifest.json) in the frontend/public directory with the app name 'BDT NURPAY WALLET', short_name 'NURPAY', theme_color '#1E3A8A', background_color '#ffffff', display 'standalone', orientation 'portrait', and icon entries for 192x192 and 512x512 PNG sizes. Register a service worker (sw.js) in frontend/public that caches the app shell for offline capability. Reference the manifest in frontend/index.html with a <link rel='manifest'> tag and add the mobile-web-app-capable and apple-mobile-web-app-capable meta tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Android setup install app download and admin all control app install android 10 ভার্সন হইতে ১৬ ভার্সন পর্যন্ত run"
        ]
      },
      "acceptanceCriteria": [
        "A manifest.json is present in frontend/public with correct name, icons, display:standalone, and theme colors",
        "A service worker is registered that caches the app shell",
        "Visiting the app in Chrome on Android 10+ shows an 'Add to Home Screen' / install prompt",
        "After installation, the app opens in standalone mode (no browser chrome)",
        "The installed app displays the NURPAY blue shield + gold N icon on the Android home screen"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Generate PWA icon assets for the manifest: a 192x192 PNG and a 512x512 PNG version of the NURPAY blue shield + gold 'N' logo, and place them as frontend/public/assets/generated/nurpay-icon-192.png and frontend/public/assets/generated/nurpay-icon-512.png. Reference these filenames in the manifest.json icons array.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Android setup install app download"
        ]
      },
      "acceptanceCriteria": [
        "nurpay-icon-192.png exists at frontend/public/assets/generated/nurpay-icon-192.png",
        "nurpay-icon-512.png exists at frontend/public/assets/generated/nurpay-icon-512.png",
        "manifest.json references both icon files with correct sizes and type image/png"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add an in-app 'Install App' banner/button on the Home page that appears when the PWA install prompt (beforeinstallprompt event) is available. The banner should display 'Install NURPAY on your device' with a download icon and an 'Install' button styled in the primary blue (#1E3A8A) theme. Dismissing the banner hides it for the session. On Android, tapping 'Install' triggers the native install prompt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Android setup install app download"
        ]
      },
      "acceptanceCriteria": [
        "An install banner appears on the Home page when beforeinstallprompt fires",
        "Tapping 'Install' triggers the browser's native install prompt",
        "Dismissing the banner hides it for the session without breaking other UI",
        "The banner does not appear if the app is already installed in standalone mode"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure the Admin Panel (/admin) is fully accessible and functional when the app is opened as an installed PWA on Android. The admin login (nuralom1/9040), all six dashboard tabs (Dashboard, Transaction Control, User Management, Transaction Management, Notifications, Support Tickets, Backup & Export), and all admin actions (set balance, approve/reject KYC, reset device, complete/cancel transactions, send announcements, reply to tickets, export CSV/JSON) must work correctly within the standalone PWA context on Android 10–16.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin all control app install android 10 ভার্সন হইতে ১৬ ভার্সন পর্যন্ত run"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin in the installed PWA loads the admin login page",
        "Admin login with nuralom1/9040 succeeds and redirects to the dashboard",
        "All admin dashboard tabs are reachable and functional on Android Chrome in standalone mode",
        "Data export (CSV/JSON) downloads work correctly on Android (using blob URL download)"
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add a viewport meta tag in frontend/index.html ensuring the app renders correctly on all Android screen sizes from Android 10 to Android 16: use content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'. Also add a theme-color meta tag set to #1E3A8A to style the Android status bar when the app runs in standalone mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "android 10 ভার্সন হইতে ১৬ ভার্সন পর্যন্ত run"
        ]
      },
      "acceptanceCriteria": [
        "index.html contains <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>",
        "index.html contains <meta name='theme-color' content='#1E3A8A'>",
        "The app renders without horizontal scroll or zoom issues on common Android screen sizes"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths",
    "PWA service worker must not break existing routing (TanStack Router hash/history routing must still work after SW caching)",
    "Admin credentials remain nuralom1/9040 — do not change backend auth logic",
    "All existing features and pages must remain fully functional after PWA additions"
  ],
  "nonGoals": [
    "Native Android APK packaging (Capacitor, Cordova, React Native) — PWA install is the target approach",
    "iOS-specific packaging or App Store submission",
    "Push notification implementation via service worker",
    "Changes to any backend Motoko logic",
    "Any new app features beyond PWA installability and Android compatibility"
  ],
  "imageRequirements": {
    "required": [
      "Blue shield shape with a gold stylized 'N' letter centered, clean flat design on transparent background, square format (nurpay-icon-192.dim_192x192.png)",
      "Blue shield shape with a gold stylized 'N' letter centered, clean flat design on transparent background, square format, high resolution (nurpay-icon-512.dim_512x512.png)"
    ],
    "edits": []
  }
}