{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Android PWA Install Support (Android 10–16) & App Completeness Polish",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Add Progressive Web App (PWA) support with manifest.json, service worker, and mobile meta tags for Android 10–16 installability",
      "acceptanceCriteria": [
        "A manifest.json is present in frontend/public with correct name, icons, display:standalone, and theme colors",
        "A service worker is registered that caches the app shell",
        "Visiting the app in Chrome on Android 10+ shows an 'Add to Home Screen' / install prompt",
        "After installation, the app opens in standalone mode (no browser chrome)",
        "The installed app displays the NURPAY blue shield + gold N icon on the Android home screen"
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "create",
          "description": "Create a web app manifest with name 'BDT NURPAY WALLET', short_name 'NURPAY', theme_color '#1E3A8A', background_color '#ffffff', display 'standalone', orientation 'portrait', and icon entries referencing frontend/public/assets/generated/nurpay-icon-192.dim_192x192.png and frontend/public/assets/generated/nurpay-icon-512.dim_512x512.png with sizes 192x192 and 512x512 respectively, type 'image/png'"
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Create a service worker that caches the app shell (index.html, main.tsx, App.tsx, CSS, and core route files) on install and serves them from cache with a network-first fallback strategy for dynamic content. Include versioned cache naming and proper activation logic to clean up old caches. Ensure TanStack Router hash-based routing continues to work correctly after caching."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add <link rel='manifest' href='/manifest.json'> in the <head> section. Add <meta name='mobile-web-app-capable' content='yes'> and <meta name='apple-mobile-web-app-capable' content='yes'> for mobile app behavior. Register the service worker by adding a <script> block before the closing </body> tag that checks for 'serviceWorker' in navigator and registers '/sw.js' if available."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Generate and wire PWA icon assets (192x192 and 512x512) showing NURPAY blue shield + gold N logo",
      "acceptanceCriteria": [
        "nurpay-icon-192.png exists at frontend/public/assets/generated/nurpay-icon-192.png",
        "nurpay-icon-512.png exists at frontend/public/assets/generated/nurpay-icon-512.png",
        "manifest.json references both icon files with correct sizes and type image/png"
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "modify",
          "description": "Ensure the icons array in manifest.json references frontend/public/assets/generated/nurpay-icon-192.dim_192x192.png with sizes '192x192' and frontend/public/assets/generated/nurpay-icon-512.dim_512x512.png with sizes '512x512', both with type 'image/png' and purpose 'any maskable'. The generated images (blue shield with gold N) will be placed at these exact paths by the image generation process."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add an in-app 'Install App' banner on the Home page that triggers the native PWA install prompt when available",
      "acceptanceCriteria": [
        "An install banner appears on the Home page when beforeinstallprompt fires",
        "Tapping 'Install' triggers the browser's native install prompt",
        "Dismissing the banner hides it for the session without breaking other UI",
        "The banner does not appear if the app is already installed in standalone mode"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePWAInstall.ts",
          "operation": "create",
          "description": "Create a custom React hook that listens for the 'beforeinstallprompt' event, stores the event object in state, provides an installApp function that calls prompt() on the stored event, tracks installation status by listening to 'appinstalled' event, and checks if the app is already running in standalone mode (window.matchMedia('(display-mode: standalone)').matches). Expose isInstallable, isInstalled, installApp, and dismissPrompt functions."
        },
        {
          "path": "frontend/src/components/InstallBanner.tsx",
          "operation": "create",
          "description": "Create an InstallBanner component that uses the usePWAInstall hook. Display a dismissible banner at the top of the page (below the header) with the text 'Install NURPAY on your device', a download icon, and an 'Install' button styled in primary blue (#1E3A8A). Show the banner only when isInstallable is true and isInstalled is false. On Install button click, call installApp(). On dismiss (X button click), call dismissPrompt() and hide the banner for the session. Use Tailwind classes for styling consistent with the app theme."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Import and render the InstallBanner component at the top of the HomePage content area, below the AppHeader and above the BalanceCard. The banner will automatically show/hide based on PWA install availability and will not interfere with existing home page functionality."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Ensure the Admin Panel is fully accessible and functional when the app runs as an installed PWA on Android 10–16",
      "acceptanceCriteria": [
        "Navigating to /admin in the installed PWA loads the admin login page",
        "Admin login with nuralom1/9040 succeeds and redirects to the dashboard",
        "All admin dashboard tabs are reachable and functional on Android Chrome in standalone mode",
        "Data export (CSV/JSON) downloads work correctly on Android (using blob URL download)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Review and ensure all CSV/JSON export functionality uses blob URLs (URL.createObjectURL) and programmatic <a> element downloads with proper cleanup (URL.revokeObjectURL). Verify that all export buttons trigger downloads correctly in standalone PWA mode on Android by using the download attribute and simulating a click event. No changes needed if already implemented correctly; otherwise, refactor export handlers to use blob-based downloads compatible with Android PWA context."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Ensure the service worker does not intercept or cache admin routes (/admin/*) or API calls, allowing dynamic admin functionality to work correctly in standalone mode. Use a network-first strategy for admin routes and backend actor calls. Add explicit exclusion logic in the fetch event handler to bypass caching for paths starting with /admin or containing backend API patterns."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add viewport and theme-color meta tags in index.html for correct rendering and status bar styling on Android 10–16",
      "acceptanceCriteria": [
        "index.html contains <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>",
        "index.html contains <meta name='theme-color' content='#1E3A8A'>",
        "The app renders without horizontal scroll or zoom issues on common Android screen sizes"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add or update the <meta name='viewport'> tag in the <head> section with content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no' to prevent zoom and ensure consistent layout on all Android screen sizes. Add <meta name='theme-color' content='#1E3A8A'> to style the Android status bar in the primary blue theme color when the app runs in standalone mode. Verify existing viewport tag is replaced if present."
        }
      ]
    }
  ]
}